//Напишите программу, которая по заданному номеру четверти, 
//показывает диапазон возможных координат точек в этой четверти 
//(x и y).

// void CheckKoord(int x)
// {
//     if (x == 1) Console.WriteLine("диапазон x>0 y>0");
//     else if (x == 2) Console.WriteLine("диапазон x<0 y>0");
//     else if (x == 3) Console.WriteLine("диапазон x<0 y<0");
//     else if (x == 4) Console.WriteLine("диапазон x>0 y<0");
// }

// try
// {

//     Console.WriteLine("Введите номер четверти");
//     int x = Convert.ToInt32(Console.ReadLine());
//     CheckKoord(x, y);
// }

// catch
// {
//     Console.WriteLine("Число должно быть от 1 до 4");
// }

